{
  "backend/main.mo": "Motoko canister handling user profiles, employee CRUD, and leave management with strict admin authorization checks.",
  "feature_evidence.json": "Feature evidence report mapping implemented features to affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Pre-generated summaries describing the purpose of each frontend file in the project.",
  "frontend/index.css": "Tailwind-based global styles defining light/dark theme tokens and shared UI variables.",
  "frontend/index.html": "HTML entry point including a process.env polyfill ensuring II_URL is safely defined at runtime.",
  "frontend/src/App.tsx": "Top-level React app configuring routing, authentication gating, and global ErrorBoundary wrapping.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Displays an access denied message for authenticated non-admin users with a sign-out option.",
  "frontend/src/components/auth/LoginButton.tsx": "Internet Identity login/logout button with loading handling and query cache reset on logout.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal prompting new users to enter their name and submit initial profile data.",
  "frontend/src/components/common/ConfirmDialog.tsx": "Reusable confirmation dialog for destructive actions with optional loading state.",
  "frontend/src/components/common/ErrorBoundary.tsx": "React error boundary that catches render errors and shows a reload prompt with optional error details.",
  "frontend/src/components/employees/AddEmployeeDialog.tsx": "Dialog form for creating a new employee, validating input and submitting via useAddEmployee.",
  "frontend/src/components/layout/AppHeader.tsx": "App header displaying logo, app title, and logged‑in user info with a login button.",
  "frontend/src/components/layout/BottomNav.tsx": "Mobile bottom navigation bar with links and active route highlighting.",
  "frontend/src/components/layout/MobileLayout.tsx": "Layout wrapper combining header, main content, and bottom navigation for mobile screens.",
  "frontend/src/components/leaves/EditLeaveDialog.tsx": "Dialog for editing a leave entry including date and type selection, updating via useUpdateLeave.",
  "frontend/src/components/leaves/LeaveResultsList.tsx": "Displays a list of leave entries with edit and delete actions using dialogs and useDeleteLeave.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to Internet Identity, refreshing dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hooks for managing Internet Identity authentication, login flow, and stored identity loading.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks wrapping actor API calls for user profiles, employees, and leave entries with automatic cache invalidation.",
  "frontend/src/index.css": "Tailwind setup defining light and dark mode CSS variables and base styles.",
  "frontend/src/lib/export/csv.ts": "Generates and downloads a CSV of leave records with employee names and formatted dates.",
  "frontend/src/lib/leaves/monthlySummary.ts": "Groups leave entries by month and returns a sorted monthly summary.",
  "frontend/src/lib/mappers/leaveType.ts": "Maps leave types to human-readable labels and vice versa.",
  "frontend/src/lib/utils.ts": "Utility function for merging Tailwind class names.",
  "frontend/src/main.tsx": "Application entry configuring React Query and Internet Identity provider before rendering App.",
  "frontend/src/pages/AddLeavePage.tsx": "Form page to create a new leave entry, validating inputs and submitting via mutation.",
  "frontend/src/pages/EmployeeLeaveHistoryPage.tsx": "Displays an employee’s leave history, monthly summary, and CSV export option.",
  "frontend/src/pages/EmployeesPage.tsx": "Lists all employees with navigation to history pages and includes add-employee dialog.",
  "frontend/src/pages/HomePage.tsx": "Home dashboard showing quick stats and navigation shortcuts for leave and employee actions.",
  "frontend/src/pages/SearchPage.tsx": "Implements a leave-record search page with employee selection, date-range filters, query hooks, on-demand filtering, and CSV export.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL parameters, persisting them in sessionStorage, and cleaning them from the URL or hash.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, themes, animations, plugins, and container settings for the frontend UI.",
  "project_state.json": "No summary available."
}