{
  "backend/main.mo": "Motoko canister handling user profiles, admin-restricted employee and leave management, backed by access control mixin and map-based storage.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to related frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten mapping of frontend file paths to short functional descriptions for reference.",
  "frontend/index.css": "Tailwind CSS base setup defining OKLCH color variables for light and dark themes with global styling.",
  "frontend/index.html": "HTML entry point loading the React app root and main TypeScript bundle.",
  "frontend/src/App.tsx": "Main React app configuring authentication gate, profile setup logic, mobile layout, and route definitions using TanStack Router.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "UI screen showing an access‑denied message with option to sign in.",
  "frontend/src/components/auth/LoginButton.tsx": "Authentication button handling Internet Identity login/logout with loading states.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal prompting a first‑time user to enter their name and save their profile.",
  "frontend/src/components/common/ConfirmDialog.tsx": "Reusable confirmation dialog with cancel/confirm actions and loading state.",
  "frontend/src/components/employees/AddEmployeeDialog.tsx": "Dialog for adding a new employee with form validation and mutation handling.",
  "frontend/src/components/layout/AppHeader.tsx": "Header displaying app branding and current user profile with login button.",
  "frontend/src/components/layout/BottomNav.tsx": "Mobile bottom navigation bar with active route highlighting.",
  "frontend/src/components/layout/MobileLayout.tsx": "Mobile-friendly layout wrapper with header, content area, and bottom navigation.",
  "frontend/src/components/leaves/EditLeaveDialog.tsx": "Dialog for editing an existing leave entry with date and type selection.",
  "frontend/src/components/leaves/LeaveResultsList.tsx": "List of leave records with employee info and edit/delete actions.",
  "frontend/src/hooks/useActor.ts": "Hook creating and managing authenticated/anonymous backend actors with query invalidation.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hooks for managing Internet Identity login, state, and persistence.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching and mutating user profiles, employees, and leave entries via the actor API with cache invalidation.",
  "frontend/src/index.css": "Defines Tailwind base styles and CSS variables for light and dark themes.",
  "frontend/src/lib/export/csv.ts": "Exports leave records and employee data to a downloadable CSV file.",
  "frontend/src/lib/leaves/monthlySummary.ts": "Groups leave entries by month and returns a sorted monthly summary.",
  "frontend/src/lib/mappers/leaveType.ts": "Maps leave types to labels and vice versa for display and parsing.",
  "frontend/src/lib/utils.ts": "Provides a utility to merge Tailwind class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/AddLeavePage.tsx": "UI page for creating a new leave entry, with form handling and submission.",
  "frontend/src/pages/EmployeeLeaveHistoryPage.tsx": "Displays an employee’s leave history, monthly summary, and CSV export option.",
  "frontend/src/pages/EmployeesPage.tsx": "Shows a list of employees with navigation to history and a dialog for adding new employees.",
  "frontend/src/pages/HomePage.tsx": "Home dashboard showing quick stats and action shortcuts for leave and employee management.",
  "frontend/src/pages/SearchPage.tsx": "Implements a leave record search page with employee selection, date filtering, result display, and CSV export. Fetches employees and leaves, applies filters, and shows results after search trigger.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading, persisting, and clearing URL and session parameters, supporting both standard and hash-based routing. Includes helpers for storing and retrieving session values safely.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, animations, container settings, and plugins like typography and container queries. Extends theme tokens for UI consistency across the app.",
  "project_state.json": "Defines the project’s current state, including features, requirements, architecture notes, and image needs for an admin-only Android leave management app. Tracks implemented features and metadata."
}