{
  "kind": "build_request",
  "title": "Fix production white-screen by preventing runtime crash and showing an error fallback",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-13",
      "text": "Prevent the app from rendering a blank white screen by adding a safe browser polyfill for `process.env` in `frontend/index.html` so any references to `process.env.II_URL` do not throw at runtime, and set a sensible default value for `process.env.II_URL` when it is missing.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "It is showing a white screen only"
        ]
      },
      "acceptanceCriteria": [
        "On a fresh load in production, the app renders UI (loading/login screen) instead of a blank white page.",
        "No `ReferenceError: process is not defined` (or equivalent) occurs in the browser console during initial load.",
        "If `process.env.II_URL` is not provided by the runtime, a default Internet Identity provider URL is present so the sign-in flow can still be initiated."
      ]
    },
    {
      "id": "REQ-14",
      "text": "Add a top-level React error boundary (or equivalent non-crashing fallback) around the application UI so any unexpected runtime error results in a visible error screen with clear English text and a reload action, rather than a white screen.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "It is showing a white screen only"
        ]
      },
      "acceptanceCriteria": [
        "When a rendering/runtime exception occurs in the React tree, an error screen is displayed with an English message (e.g., 'Something went wrong') and a 'Reload' button.",
        "The error screen is styled consistently with the existing Tailwind/Shadcn theme (no unstyled blank page).",
        "Normal navigation and screens work when no error is thrown."
      ]
    }
  ],
  "constraints": [
    "Do not edit immutable frontend paths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, and anything under frontend/src/components/ui.",
    "Keep the backend architecture as a single Motoko actor; no new backend services."
  ],
  "nonGoals": [
    "Adding new product features beyond resolving the white-screen behavior.",
    "Changing authentication provider behavior beyond providing a safe default to avoid crashes."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}