{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Prevent production white-screen with safe env polyfill and top-level error fallback",
  "requirements": [
    {
      "id": "REQ-13",
      "summary": "Polyfill `process.env` safely in the browser and provide a default `process.env.II_URL` so Internet Identity initialization cannot crash on load.",
      "acceptanceCriteria": [
        "On a fresh load in production, the app renders UI (loading/login screen) instead of a blank white page.",
        "No `ReferenceError: process is not defined` (or equivalent) occurs in the browser console during initial load.",
        "If `process.env.II_URL` is not provided by the runtime, a default Internet Identity provider URL is present so the sign-in flow can still be initiated."
      ],
      "file_operations": [
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Add a small, early inline script (before the app bundle) that initializes a safe global `process` object with an `env` object if missing, and ensures `process.env.II_URL` has a sensible default (e.g., the standard Internet Identity URL) when not provided, so `process.env.II_URL` reads in the React bundle do not throw at runtime."
        }
      ]
    },
    {
      "id": "REQ-14",
      "summary": "Add a top-level React error boundary so unexpected runtime errors show a styled fallback screen with a clear message and reload action instead of a white screen.",
      "acceptanceCriteria": [
        "When a rendering/runtime exception occurs in the React tree, an error screen is displayed with an English message (e.g., 'Something went wrong') and a 'Reload' button.",
        "The error screen is styled consistently with the existing Tailwind/Shadcn theme (no unstyled blank page).",
        "Normal navigation and screens work when no error is thrown."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/common/ErrorBoundary.tsx",
          "operation": "create",
          "description": "Create a reusable top-level React Error Boundary component that catches render/lifecycle errors and renders a themed fallback UI using existing Tailwind/shadcn styling (e.g., an Alert-style message plus a 'Reload' Button that calls `window.location.reload()`)."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wrap the application UI (AuthGate + MobileLayout + RouterProvider) with the new ErrorBoundary so any unexpected runtime error results in the visible fallback screen rather than a blank page; ensure the normal app flow is unchanged when no error occurs."
        }
      ]
    }
  ]
}